==================
Simple free function
==================

function helper() {}

---

(source_file
  (function_definition
    name: (identifier)
    parameters: (parameter_list)
    body: (block)))

==================
Free function with parameters and returns
==================

function add(uint x, uint y) pure returns (uint) {
  return x + y;
}

---

(source_file
  (function_definition
    name: (identifier)
    parameters: (parameter_list
      (parameter_declaration
        type: (uint_type)
        name: (identifier))
      (parameter_declaration
        type: (uint_type)
        name: (identifier)))
    mutability: (state_mutability)
    returns: (returns_clause
      returns: (parameter_list
        (parameter_declaration
          type: (uint_type))))
    body: (block
      (return_statement
        value: (additive_expression
          left: (primary_expression
            (identifier))
          operator: (additive_operator)
          right: (primary_expression
            (identifier)))))))

==================
Internal free function (explicit)
==================

function mul(uint x, uint y) internal pure returns (uint) {
  return x * y;
}

---

(source_file
  (function_definition
    name: (identifier)
    parameters: (parameter_list
      (parameter_declaration
        type: (uint_type)
        name: (identifier))
      (parameter_declaration
        type: (uint_type)
        name: (identifier)))
    visibility: (visibility)
    mutability: (state_mutability)
    returns: (returns_clause
      returns: (parameter_list
        (parameter_declaration
          type: (uint_type))))
    body: (block
      (return_statement
        value: (multiplicative_expression
          left: (primary_expression
            (identifier))
          operator: (multiplicative_operator)
          right: (primary_expression
            (identifier)))))))

==================
Virtual function
==================

function myFunction() public virtual {}

---

(source_file
  (function_definition
    name: (identifier)
    parameters: (parameter_list)
    visibility: (visibility)
    body: (block)))

==================
Function with simple override
==================

function myFunction() public override {}

---

(source_file
  (function_definition
    name: (identifier)
    parameters: (parameter_list)
    visibility: (visibility)
    (override_specifier)
    body: (block)))

==================
Function with override and single base
==================

function myFunction() public override(Base) {}

---

(source_file
  (function_definition
    name: (identifier)
    parameters: (parameter_list)
    visibility: (visibility)
    (override_specifier
      from: (identifier_path
        (identifier)))
    body: (block)))

==================
Function with override and multiple bases
==================

function myFunction() public override(Base1, Base2) {}

---

(source_file
  (function_definition
    name: (identifier)
    parameters: (parameter_list)
    visibility: (visibility)
    (override_specifier
      from: (identifier_path
        (identifier))
      from: (identifier_path
        (identifier)))
    body: (block)))

==================
Virtual and override function
==================

function myFunction() public virtual override {}

---

(source_file
  (function_definition
    name: (identifier)
    parameters: (parameter_list)
    visibility: (visibility)
    (override_specifier)
    body: (block)))

==================
Function with modifiers
==================

function myFunction() public onlyOwner returns (bool) {}

---

(source_file
  (function_definition
    name: (identifier)
    parameters: (parameter_list)
    visibility: (visibility)
    modifier: (modifier_invocation
      name: (identifier_path
        (identifier)))
    returns: (returns_clause
      returns: (parameter_list
        (parameter_declaration
          type: (bool_type))))
    body: (block)))
