==================
State variable of type bytes (dynamic)
==================

contract C {
  bytes myVar;
}

---

(source_file
  (contract_definition
    name: (identifier)
    body: (contract_body
      (state_variable_declaration
        type: (bytes_type)
        name: (identifier)))))

==================
State variable of type bytes1
==================

contract C {
  bytes1 myVar;
}

---

(source_file
  (contract_definition
    name: (identifier)
    body: (contract_body
      (state_variable_declaration
        type: (bytes_type)
        name: (identifier)))))

==================
State variable of type bytes32
==================

contract C {
  bytes32 myVar;
}

---

(source_file
  (contract_definition
    name: (identifier)
    body: (contract_body
      (state_variable_declaration
        type: (bytes_type)
        name: (identifier)))))

==================
Bytes types in a function definition
==================

contract C {
  function process(bytes memory data, bytes32 data1, bytes8 data2) public {
    bytes1 local = data1[0];
  }
}

---

(source_file
  (contract_definition
    name: (identifier)
    body: (contract_body
      (function_definition
        name: (identifier)
        parameters: (parameter_list
          (parameter_declaration
            type: (bytes_type)
            location: (data_location)
            name: (identifier))
          (parameter_declaration
            type: (bytes_type)
            name: (identifier))
          (parameter_declaration
            type: (bytes_type)
            name: (identifier)))
        visibility: (visibility)
        body: (block
          (variable_declaration_statement
            declaration: (variable_declaration
              type: (bytes_type)
              name: (identifier))
            value: (index_access_expression
              base: (primary_expression
                (identifier))
              index: (primary_expression
                (literal
                  (number_literal))))))))))
