==================
Simple function call
==================

contract C {
  function f() {
    doSomething(1, true);
  }
}
---

(source_file
  definition: (contract
    name: (identifier)
    function: (function
      name: (identifier)
      body: (block
        (expression_statement
          (call_expression
            function: (primary_expression
              (identifier))
            arguments: (argument_list
              argument: (literal
                (number))
              argument: (literal
                (boolean)))))))))

==================
Function call with value option
==================

contract C {
  function f() {
    doSomething{value: 1}();
  }
}
---

(source_file
  definition: (contract
    name: (identifier)
    function: (function
      name: (identifier)
      body: (block
        (expression_statement
          (call_expression
            function: (primary_expression
              (identifier))
            options: (call_options_block
              (named_argument
                name: (identifier)
                value: (literal
                  (number))))
            arguments: (argument_list)))))))

==================
Function call with gas option
==================

contract C {
  function f() {
    doSomething{gas: 10000}();
  }
}
---

(source_file
  definition: (contract
    name: (identifier)
    function: (function
      name: (identifier)
      body: (block
        (expression_statement
          (call_expression
            function: (primary_expression
              (identifier))
            options: (call_options_block
              (named_argument
                name: (identifier)
                value: (literal
                  (number))))
            arguments: (argument_list)))))))

==================
Function call with both value and gas options
==================

contract C {
  function f() {
    doSomething{value: 1, gas: 10000}();
  }
}
---

(source_file
  definition: (contract
    name: (identifier)
    function: (function
      name: (identifier)
      body: (block
        (expression_statement
          (call_expression
            function: (primary_expression
              (identifier))
            options: (call_options_block
              (named_argument
                name: (identifier)
                value: (literal
                  (number)))
              (named_argument
                name: (identifier)
                value: (literal
                  (number))))
            arguments: (argument_list)))))))

==================
Function call options with arguments
==================

contract C {
  function f() {
    doSomething{value: 1}(true);
  }
}
---

(source_file
  definition: (contract
    name: (identifier)
    function: (function
      name: (identifier)
      body: (block
        (expression_statement
          (call_expression
            function: (primary_expression
              (identifier))
            options: (call_options_block
              (named_argument
                name: (identifier)
                value: (literal
                  (number))))
            arguments: (argument_list
              argument: (literal
                (boolean)))))))))

==================
Function call options on a member access
==================
contract C {
  function f() {
    myContract.doSomething{value: 1}();
  }
}
---

(source_file
  definition: (contract
    name: (identifier)
    function: (function
      name: (identifier)
      body: (block
        (expression_statement
          (call_expression
            function: (member_access_expression
              object: (primary_expression
                (identifier))
              member: (identifier))
            options: (call_options_block
              (named_argument
                name: (identifier)
                value: (literal
                  (number))))
            arguments: (argument_list)))))))
