==================
Simple less-than comparison with literals
==================

bool constant x = 1 < 2;

---

(source_file
  definition: (constant_variable
    type: (primitive_type
      (bool_type))
    name: (symbol
      name: (identifier))
    value: (comparison
      left: (literal
        (number))
      operator: (lt)
      right: (literal
        (number)))))

==================
Greater-than-or-equal comparison with variables
==================

contract C {
    function f(uint a, uint b) public pure returns (bool) {
        return a >= b;
    }
}

---

(source_file
  definition: (contract
    name: (symbol
      name: (identifier))
    definition: (function
      name: (symbol
        name: (identifier))
      parameters: (parameters
        parameter: (parameter
          type: (primitive_type
            (uint_type))
          name: (symbol
            name: (identifier)))
        parameter: (parameter
          type: (primitive_type
            (uint_type))
          name: (symbol
            name: (identifier))))
      visibility: (public)
      mutability: (pure)
      returns: (parameters
        parameter: (parameter
          type: (primitive_type
            (bool_type))))
      body: (block
        statement: (return_statement
          value: (comparison
            left: (symbol
              name: (identifier))
            operator: (gte)
            right: (symbol
              name: (identifier))))))))

==================
Comparison precedence with addition
==================

// Should parse as (a + b) > c
bool constant x = a + b > c;

---

(source_file
  (comment)
  definition: (constant_variable
    type: (primitive_type
      (bool_type))
    name: (symbol
      name: (identifier))
    value: (comparison
      left: (arithmetic
        (add
          left: (symbol
            name: (identifier))
          operator: (add_op)
          right: (symbol
            name: (identifier))))
      operator: (gt)
      right: (symbol
        name: (identifier)))))

==================
Comparison precedence with multiplication
==================

// Should parse as a < (b * c)
bool constant x = a < b * c;

---

(source_file
  (comment)
  definition: (constant_variable
    type: (primitive_type
      (bool_type))
    name: (symbol
      name: (identifier))
    value: (comparison
      left: (symbol
        name: (identifier))
      operator: (lt)
      right: (arithmetic
        (mul
          left: (symbol
            name: (identifier))
          operator: (mul_op)
          right: (symbol
            name: (identifier)))))))

==================
Comparison used in a logical AND expression
==================

// Should parse as (a < b) && (c > d)
bool constant x = a < b && c > d;

---

(source_file
  (comment)
  definition: (constant_variable
    type: (primitive_type
      (bool_type))
    name: (symbol
      name: (identifier))
    value: (and
      left: (comparison
        left: (symbol
          name: (identifier))
        operator: (lt)
        right: (symbol
          name: (identifier)))
      operator: (and_op)
      right: (comparison
        left: (symbol
          name: (identifier))
        operator: (gt)
        right: (symbol
          name: (identifier))))))

==================
Chained comparisons (invalid Solidity, but should parse)
==================

// Solidity does not support chained comparisons, but the parser should handle it gracefully.
// The linter would then flag this as an error. Parsed as (a < b) < c.
bool constant x = a < b < c;

---

(source_file
  (comment)
  (comment)
  definition: (constant_variable
    type: (primitive_type
      (bool_type))
    name: (symbol
      name: (identifier))
    value: (comparison
      left: (comparison
        left: (symbol
          name: (identifier))
        operator: (lt)
        right: (symbol
          name: (identifier)))
      operator: (lt)
      right: (symbol
        name: (identifier)))))

==================
Comparison in an if statement condition
==================

contract C {
    function f(uint a) public pure {
        if (a > 100) {
            // ...
        }
    }
}

---

(source_file
  definition: (contract
    name: (symbol
      name: (identifier))
    definition: (function
      name: (symbol
        name: (identifier))
      parameters: (parameters
        parameter: (parameter
          type: (primitive_type
            (uint_type))
          name: (symbol
            name: (identifier))))
      visibility: (public)
      mutability: (pure)
      body: (block
        statement: (if_statement
          condition: (comparison
            left: (symbol
              name: (identifier))
            operator: (gt)
            right: (literal
              (number)))
          consequence: (block
            (comment)))))))

==================
Comparison in a require statement
==================

contract C {
    function f(uint a) public pure {
        require(a <= 10, "Value too high");
    }
}

---

(source_file
  definition: (contract
    name: (symbol
      name: (identifier))
    definition: (function
      name: (symbol
        name: (identifier))
      parameters: (parameters
        parameter: (parameter
          type: (primitive_type
            (uint_type))
          name: (symbol
            name: (identifier))))
      visibility: (public)
      mutability: (pure)
      body: (block
        statement: (call
          function: (builtin_function
            name: (require))
          arguments: (arguments
            argument: (comparison
              left: (symbol
                name: (identifier))
              operator: (lte)
              right: (literal
                (number)))
            argument: (literal
              (string))))))))

==================
Comparison involving a function call
==================

contract C {
    function getLimit() public pure returns (uint) { return 100; }
    function check(uint val) public pure returns (bool) {
        return val < getLimit();
    }
}

---

(source_file
  definition: (contract
    name: (symbol
      name: (identifier))
    definition: (function
      name: (symbol
        name: (identifier))
      visibility: (public)
      mutability: (pure)
      returns: (parameters
        parameter: (parameter
          type: (primitive_type
            (uint_type))))
      body: (block
        statement: (return_statement
          value: (literal
            (number)))))
    definition: (function
      name: (symbol
        name: (identifier))
      parameters: (parameters
        parameter: (parameter
          type: (primitive_type
            (uint_type))
          name: (symbol
            name: (identifier))))
      visibility: (public)
      mutability: (pure)
      returns: (parameters
        parameter: (parameter
          type: (primitive_type
            (bool_type))))
      body: (block
        statement: (return_statement
          value: (comparison
            left: (symbol
              name: (identifier))
            operator: (lt)
            right: (call
              function: (symbol
                name: (identifier))
              arguments: (arguments))))))))
