==================
Simple left shift with literals
==================

uint x = 1 << 8;

---

(source_file
  definition: (variable
    type: (primitive_type
      (uint_type))
    name: (symbol
      name: (identifier))
    value: (shift
      left: (literal
        (number))
      operator: (shift_op)
      right: (literal
        (number)))))

==================
Simple right shift with variables
==================

contract C {
    function f(uint a, uint b) public pure returns (uint) {
        return a >> b;
    }
}

---

(source_file
  definition: (contract
    name: (symbol
      name: (identifier))
    function: (function
      name: (symbol
        name: (identifier))
      parameters: (parameter_list
        parameter: (parameter
          type: (primitive_type
            (uint_type))
          name: (identifier))
        parameter: (parameter
          type: (primitive_type
            (uint_type))
          name: (identifier)))
      visibility: (visibility)
      mutability: (state_mutability)
      returns: (parameter_list
        parameter: (parameter
          type: (primitive_type
            (uint_type))))
      body: (block
        (return_statement
          value: (shift
            left: (identifier)
            operator: (shift_op)
            right: (identifier)))))))

==================
Unsigned right shift
==================

uint x = 256 >>> 2;

---

(source_file
  definition: (variable
    type: (primitive_type
      (uint_type))
    name: (symbol
      name: (identifier))
    value: (shift
      left: (literal
        (number))
      operator: (shift_op)
      right: (literal
        (number)))))

==================
Chained shift expressions (left-associative)
==================

// Should parse as (a << b) << c
uint x = a << b << c;

---

(source_file
  (comment)
  definition: (variable
    type: (primitive_type
      (uint_type))
    name: (symbol
      name: (identifier))
    value: (shift
      left: (shift
        left: (identifier)
        operator: (shift_op)
        right: (identifier))
      operator: (shift_op)
      right: (identifier))))

==================
Shift precedence with arithmetic operators (add/mul)
==================

// Should parse as (a * 2) << (b + 1)
uint x = a * 2 << b + 1;

---

(source_file
  (comment)
  definition: (variable
    type: (primitive_type
      (uint_type))
    name: (symbol
      name: (identifier))
    value: (shift
      left: (arithmetic
        (mul
          left: (identifier)
          operator: (mul_op)
          right: (literal
            (number))))
      operator: (shift_op)
      right: (arithmetic
        (add
          left: (identifier)
          operator: (add_op)
          right: (literal
            (number)))))))

==================
Shift precedence with bitwise AND
==================

// Should parse as (a << b) & c
uint x = a << b & c;

---

(source_file
  (comment)
  definition: (variable
    type: (primitive_type
      (uint_type))
    name: (symbol
      name: (identifier))
    value: (bitwise
      (bitand
        left: (shift
          left: (identifier)
          operator: (shift_op)
          right: (identifier))
        operator: (bitand_op)
        right: (identifier)))))

==================
Shift precedence with comparison operators
==================

// Should parse as (a >> b) < c
bool x = a >> b < c;

---

(source_file
  (comment)
  definition: (variable
    type: (primitive_type
      (bool_type))
    name: (symbol
      name: (identifier))
    value: (comparison
      left: (shift
        left: (identifier)
        operator: (shift_op)
        right: (identifier))
      operator: (comparison_op)
      right: (identifier))))

==================
Shift with parenthesized bitwise AND
==================

// Should parse as a << (b & MASK)
uint x = a << (b & MASK);

---

(source_file
  (comment)
  definition: (variable
    type: (primitive_type
      (uint_type))
    name: (symbol
      name: (identifier))
    value: (shift
      left: (identifier)
      operator: (shift_op)
      right: (group
        expression: (bitwise
          (bitand
            left: (identifier)
            operator: (bitand_op)
            right: (identifier)))))))

==================
Shift in a require statement
==================

contract C {
    function f(uint a) public pure {
        require(a >> 8 > 0, "High bits must be set");
    }
}

---

(source_file
  definition: (contract
    name: (symbol
      name: (identifier))
    function: (function
      name: (symbol
        name: (identifier))
      parameters: (parameter_list
        parameter: (parameter
          type: (primitive_type
            (uint_type))
          name: (identifier)))
      visibility: (visibility)
      mutability: (state_mutability)
      body: (block
        (expression_statement
          (call_expression
            function: (identifier)
            arguments: (argument_list
              argument: (comparison
                left: (shift
                  left: (identifier)
                  operator: (shift_op)
                  right: (literal
                    (number)))
                operator: (comparison_op)
                right: (literal
                  (number)))
              argument: (literal
                (string)))))))))
