==================
Simple contract definition
==================

contract MyContract {}

---

(source_file
  definition: (contract
    name: (symbol
      name: (identifier))))

==================
Abstract contract
==================

abstract contract MyAbstractContract {}

---

(source_file
  definition: (contract
    abstract: (abstract)
    name: (symbol
      name: (identifier))))

==================
Contract with simple inheritance
==================

contract MyContract is Ownable, ReentrancyGuard {}

---

(source_file
  definition: (contract
    name: (symbol
      name: (identifier))
    parents: (parent_list
      parent: (parent
        name: (symbol
          name: (identifier)))
      parent: (parent
        name: (symbol
          name: (identifier))))))

==================
Contract with constructor arguments
==================

contract MyToken is ERC20("My Token", "MTK") {}

---

(source_file
  definition: (contract
    name: (symbol
      name: (identifier))
    parents: (parent_list
      parent: (parent
        name: (symbol
          name: (identifier))
        arguments: (argument_list
          argument: (literal
            (string))
          argument: (literal
            (string)))))))

==================
Contract with empty constructor arguments
==================

contract MyContract is ReentrancyGuard() {}

---

(source_file
  definition: (contract
    name: (symbol
      name: (identifier))
    parents: (parent_list
      parent: (parent
        name: (symbol
          name: (identifier))
        arguments: (argument_list)))))

==================
Contract with mixed inheritance styles
==================

contract MegaContract is Ownable, ERC20("Mega", "MGA"), Lockable() {}

---

(source_file
  definition: (contract
    name: (symbol
      name: (identifier))
    parents: (parent_list
      parent: (parent
        name: (symbol
          name: (identifier)))
      parent: (parent
        name: (symbol
          name: (identifier))
        arguments: (argument_list
          argument: (literal
            (string))
          argument: (literal
            (string))))
      parent: (parent
        name: (symbol
          name: (identifier))
        arguments: (argument_list)))))
